src/cf/Catalogs/уатПластиковыеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатПластиковыеКарты</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КемВыдана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.уатАЗС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомуВыдана</Name>
					<Comment>Кому выдана</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Comment>Основная топливная карта</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСтатусыТопливныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПинКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDкарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЛимит</Name>
					<Comment>Помечено на удаление в релизе 1.1.30.1</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСтатусыКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/уатИсторияПеремещенияТопливныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатИсторияПеремещенияТопливныхКарт</Name>
			<Comment>Используется для хранения истории изменения владельца карты</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КомуВыдана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Карта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПластиковыеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатИсторияУстановкиЛимитовТопливныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатИсторияУстановкиЛимитовТопливныхКарт</Name>
			<Comment>Используется для хранения истории установки лимитов топливных карт</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Лимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Карта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПластиковыеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КомуВыдана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЛимита</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипыЛимитовТопливныхКарт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатИсторияИзмененияСтатусаБлокировкиТопливныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатИсторияИзмененияСтатусаБлокировкиТопливныхКарт</Name>
			<Comment>Используется для хранения истории изменения статуса блокировки топливных карт</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заблокирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Карта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПластиковыеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КомуВыдана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/уатАЗС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатАЗС</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент_Склад</Name>
					<Comment>Контрагент / склад</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоАЗССклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлВнешнейОбработки</Name>
					<Comment>Хранилище данных файла внешней обработки</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗагрузкиДанныхОтПЦ</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыЗагрузкиДанныхОтПЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьПЦ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатУчетныеЗаписиПЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСтандартнуюОбработкуЗагрузкиДанныхПЦ</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильОбменаСПЦ</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПрофилиОбменаСВнешнимиСистемами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствиеГСМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГСМизФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Адреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПунктНазначения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыКарт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/уатПластиковыеКарты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	
	Если НЕ ЗначениеЗаполнено(Объект.КомуВыдана)
		И Параметры.Свойство("КомуВыдана") Тогда
		Объект.КомуВыдана = Параметры.КомуВыдана;
	КонецЕсли;
	
	флЗаписьНового = Объект.Ссылка.Пустая();
	
	Если флЗаписьНового Тогда
		Элементы.ГруппаЗаполнитьАдресПоУмолчанию.Видимость	 = Ложь;
		Элементы.КомуВыдана.ТолькоПросмотр				 = Ложь;
		Элементы.ДатаВыдачи.ТолькоПросмотр				 = Ложь;
		Объект.ДатаВыдачи								 = ТекущаяДатаСеанса();
		Элементы.ДатаВыдачи.Ширина = 8;
	Иначе
		СтруктураИстории	 = ОбновитьДанныеОВладельце(Объект.Ссылка);
		ЗаполнитьЗначенияСвойств(Объект, СтруктураИстории);
	КонецЕсли;
	
	Элементы.ГруппаСтатус.Видимость = ЗначениеЗаполнено(Объект.ДатаОкончания) И Объект.ДатаОкончания < ТекущаяДата()
		ИЛИ Объект.Статус.Действует = Ложь;
		
	Если ЗначениеЗаполнено(Объект.КемВыдана)
			И ТипЗнч(Объект.КемВыдана) = Тип("СправочникСсылка.уатАЗС") Тогда
		УчетнаяЗаписьПЦ = ЗначениеРеквизитаОбъекта(Объект.КемВыдана, "УчетнаяЗаписьПЦ");
		ВнешняяСистема  = ЗначениеРеквизитаОбъекта(УчетнаяЗаписьПЦ, "ВнешняяСистема");
	КонецЕсли;
	ПолучитьЗаголовокБлокировки();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьВидимость();
	УстановитьДоступностьПолей();
	НастроитьОтборы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	УдалитьНезначащиеСимволы(Объект.Код);
	Если Объект.Основная 
		И ЗначениеЗаполнено(Объект.КомуВыдана) Тогда
		ДругаяКарта = ПолучитьДругуюОсновнуюКарту(Объект.Ссылка, Объект.КомуВыдана);
		Если ДругаяКарта <> Неопределено Тогда
			Отказ = Истина;
			ТекстНСТР = НСтр("en='In ""%1"" already have a primary fuel card ""%2"" issued by ""%3""!';ru='У ""%1"" уже имеется основная топливная карта ""%2"", выданная ""%3""!'");
			ТекстНСТР = СтрШаблон(ТекстНСТР, Объект.КомуВыдана, ДругаяКарта.Ссылка, ДругаяКарта.КемВыдана);
			ПоказатьПредупреждение(Неопределено, ТекстНСТР);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Элементы.ГруппаЗаполнитьАдресПоУмолчанию.Видимость = НЕ флЗаписьНового;
	НастроитьОтборы();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КомуВыданаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Список = Новый СписокЗначений;
	Список.Добавить(НСтр("en = 'Vehicle'; ru = 'ТС'"));
	Список.Добавить(НСтр("en='Driver';ru='Водитель'"));
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("КомуВыданаНачалоВыбораЗавершение", ЭтотОбъект,
		Новый Структура("Элемент", Элемент)), Список, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КомуВыданаНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	Перем СтандартнаяОбработка;
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = НСтр("en = 'Vehicle'; ru = 'ТС'") Тогда
		уатИнтерфейсВводаТС.РеквизитТСНачалоВыбора(ДополнительныеПараметры.Элемент, Объект.КомуВыдана, Неопределено, СтандартнаяОбработка);
	Иначе
		уатЗащищенныеФункцииКлиент.ДиалогВыбораСотрудника(ДополнительныеПараметры.Элемент, Объект.КомуВыдана, Новый Структура, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомуВыданаОткрытие(Элемент, СтандартнаяОбработка)
	Если ТипЗнч(Объект.КомуВыдана) = Тип("СправочникСсылка.Сотрудники") Тогда
		уатЗащищенныеФункцииКлиент.ОткрытьФормуСотрудника(Объект.КомуВыдана, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомуВыданаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если ТипЗнч(Объект.КомуВыдана) = Тип("СправочникСсылка.Сотрудники") Тогда
		уатИнтерфейсВводаСотрудников.СотрудникАвтоПодборТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомуВыданаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если ТипЗнч(Объект.КомуВыдана) = Тип("СправочникСсылка.Сотрудники") Тогда
		уатИнтерфейсВводаСотрудников.СотрудникОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КемВыданаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Список = Новый СписокЗначений;
	Список.Добавить(НСтр("en='Gas station';ru='АЗС'"));
	Список.Добавить(НСтр("en='Counterparties';ru='Контрагенты'"));
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("КемВыданаНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), Список, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КемВыданаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Объект.IDкарты = Неопределено;
	
	ЗагрузкаИзAPI = Ложь;
	УстановитьВидимостьСервер(ЗагрузкаИзAPI);
	
	Если ЗагрузкаИзAPI Тогда
		ПолучитьСтатусКарты();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КемВыданаНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = НСтр("en='Gas station';ru='АЗС'") Тогда
		ОткрытьФорму("Справочник.уатАЗС.Форма.ФормаВыбора",,ДополнительныеПараметры.Элемент);
	Иначе
		ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора",,ДополнительныеПараметры.Элемент);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИзменитьВладельцаНажатие(Элемент)
	
	Отказ = Ложь;
	уатОбщегоНазначенияКлиент.ПроверитьЗаписьНовогоОбъектаВФорме(ЭтотОбъект, Объект.Ссылка,,, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	ЗначенияЗаписи = ПолучитьЗначенияЗаписиИстории(Объект.Ссылка);
	

	Если ЗначенияЗаписи.Период = '00010101' Тогда
		ПараметрыФормы	 = Новый Структура();
		СтруктураОтбора	 = Новый Структура();
		СтруктураОтбора.Вставить("Карта",				 Объект.Ссылка);
		СтруктураОтбора.Вставить("КомуВыдана",			 Объект.КомуВыдана);
		ПараметрыФормы.Вставить("ЗначенияЗаполнения",	 СтруктураОтбора);
	Иначе
		ПараметрыФормы	 = Новый Структура();
		СтруктураОтбора	 = Новый Структура();
		СтруктураОтбора.Вставить("Карта",				 Объект.Ссылка);
		СтруктураОтбора.Вставить("КомуВыдана",			 ЗначенияЗаписи.КомуВыдана);
		Если ЗначенияЗаписи.Период = НачалоДня(ТекущаяДата()) Тогда
			ПараметрыФормы.Вставить("Ключ",					 ПолучитьКлючЗаписиИсторияПеремещенияТопливныхКарт(Объект.Ссылка));
		КонецЕсли;
		ПараметрыФормы.Вставить("ЗначенияЗаполнения",	 СтруктураОтбора);
	КонецЕсли; 

	ОткрытьФорму("РегистрСведений.уатИсторияПеремещенияТопливныхКарт.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект,,,, Новый ОписаниеОповещения("ДекорацияДекорацияИзменитьВладельцаНажатиеЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	Элементы.ГруппаСтатус.Видимость = ЗначениеЗаполнено(Объект.ДатаОкончания) И Объект.ДатаОкончания < ТекущаяДата()
		ИЛИ ЗначениеРеквизитаОбъекта(Объект.Статус, "Действует") = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	Элементы.ГруппаСтатус.Видимость = ЗначениеЗаполнено(Объект.ДатаОкончания) И Объект.ДатаОкончания < ТекущаяДата()
		ИЛИ ЗначениеРеквизитаОбъекта(Объект.Статус, "Действует") = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДатаВыдачиПриИзменении(Элемент)
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ДатаВыдачиПриИзмененииСервер();

КонецПроцедуры

&НаКлиенте
Процедура ОтображатьНеДействующиеЛимитыПриИзменении(Элемент)
	Если ОтображатьНеДействующиеЛимиты Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Лимиты.Отбор, "Действует",,,, Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Лимиты.Отбор, "Действует",
			Истина, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛимитыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Ложь;
	уатОбщегоНазначенияКлиент.ПроверитьЗаписьНовогоОбъектаВФорме(ЭтотОбъект, Объект.Ссылка,,, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПеремещенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Ложь;
	уатОбщегоНазначенияКлиент.ПроверитьЗаписьНовогоОбъектаВФорме(ЭтотОбъект, Объект.Ссылка,,, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

&НаКлиенте
Процедура ЗаблокироватьРазблокировать(Команда)
	
	Если ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Газпромнефть") Тогда
		ЗаблокироватьРазблокироватьГазпромнефть();
	ИначеЕсли ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.ЛукойлЛИКАРД") Тогда
		ЗаблокироватьРазблокироватьЛукойл();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусКарты(Команда)
	ПолучитьСтатусКарты(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИдентификаторКарты(Команда)
	Если ТипЗнч(Объект.КемВыдана) <> Тип("СправочникСсылка.уатАЗС") Тогда 
		Возврат;
	КонецЕсли;
	
	Если ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Газпромнефть") Тогда
		IDкарты = ПолучитьИдентификаторКартыГазпромнефть();
	ИначеЕсли ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.ЛукойлЛИКАРД") Тогда
		IDкарты = ПолучитьИдентификаторКартыЛукойл();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(IDкарты) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = 'Карта не найдена.'; en = 'Map not found.'"));
		Возврат
	Иначе
		Объект.IDкарты = IDкарты;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВладельца(Команда)
	Если ТипЗнч(Объект.КемВыдана) <> Тип("СправочникСсылка.уатАЗС") Тогда 
		Возврат;
	КонецЕсли;
	
	Если ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.ЛукойлЛИКАРД") Тогда
		ПолучитьВладельцаКартыЛукойл();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЛимиты(Команда)  
	Если ТипЗнч(Объект.КемВыдана) <> Тип("СправочникСсылка.уатАЗС") 
		ИЛИ НЕ ЗначениеЗаполнено(Объект.IDкарты) Тогда 
		ТекстНстр = Нстр("ru = 'Не заполнен идентификатор карты процессингового центра.'; en = 'The processing center card identifier is not filled in.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНстр,, "Объект.IDкарты");
		Возврат;
	КонецЕсли;
	ЗагрузитьЛимитыСервер();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура УстановитьВидимость()

	УстановитьВидимостьСервер();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСервер(ЗагрузкаИзAPI = Ложь)

	Если ЗначениеЗаполнено(Объект.КемВыдана) 
		И ТипЗнч(Объект.КемВыдана) = Тип("СправочникСсылка.уатАЗС") Тогда
		УчетнаяЗаписьПЦ = Объект.КемВыдана.УчетнаяЗаписьПЦ;
		ЗагрузкаИзAPI = ТипЗнч(Объект.КемВыдана) = Тип("СправочникСсылка.уатАЗС")
		И ЗначениеЗаполнено(УчетнаяЗаписьПЦ)
		И (УчетнаяЗаписьПЦ.ВнешняяСистема = Справочники.уатВнешниеСистемы.Газпромнефть
		ИЛИ УчетнаяЗаписьПЦ.ВнешняяСистема = Справочники.уатВнешниеСистемы.ЛукойлЛИКАРД);
	Иначе
		ЗагрузкаИзAPI = Ложь;
	КонецЕсли;
	Элементы.ФормаЗаблокироватьРазблокировать.Видимость	 = ЗагрузкаИзAPI;
	Элементы.ГруппаIDкарты.Видимость					 = ЗагрузкаИзAPI;
	Элементы.ЗаполнитьВладельца.Видимость				 = ЗагрузкаИзAPI
	И УчетнаяЗаписьПЦ.ВнешняяСистема = Справочники.уатВнешниеСистемы.ЛукойлЛИКАРД;
	Элементы.ОбновитьСтатусКарты.Видимость				 = ЗагрузкаИзAPI;
	Элементы.ЗагрузитьЛимиты.Видимость					 = ЗначениеЗаполнено(УчетнаяЗаписьПЦ)
		И НЕ УчетнаяЗаписьПЦ.ВнешняяСистема = Справочники.уатВнешниеСистемы.ППР;
		
	Если НЕ ЗагрузкаИзAPI Тогда
		Элементы.Статус.Ширина = 21;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИдентификаторКартыГазпромнефть()
	
	ТекстОшибки = "";
	СтруктураПараметровУчетнойЗаписи = уатЗагрузкаПЦ.ПолучитьСтруктуруПараметровДляРаботыСПЦ(УчетнаяЗаписьПЦ);
	
	МассивКарт = уатЗагрузкаПЦ.Газпромнефть_ПолучитьМассивКарт(СтруктураПараметровУчетнойЗаписи, ТекстОшибки);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат "";
	КонецЕсли;

	Для Каждого ТекКарта Из МассивКарт Цикл
		Если ТекКарта.Номер = Объект.Код Тогда
			IDкарты = ТекКарта.Идентификатор;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат IDкарты;
	
КонецФункции

&НаКлиенте
Функция ПолучитьИдентификаторКартыЛукойл()
	
	ТекстОшибки = "";

	IDКонтракта     = СтрЗаменить(СтрЗаменить(Строка(Объект.Код), Символы.НПП, ""), " ", "");
	СтруктураПараметровУчетнойЗаписи = уатЗагрузкаПЦ.ПолучитьСтруктуруПараметровДляРаботыСПЦ(УчетнаяЗаписьПЦ);
	IDКонтракта = уатЗагрузкаПЦ.ЛИКАРД_ПолучитьIDКонтрактаПоНомеру(СтруктураПараметровУчетнойЗаписи, IDКонтракта, ТекстОшибки);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	Возврат СтрЗаменить(СтрЗаменить(Строка(IDКонтракта), Символы.НПП, ""), " ", "");
	
КонецФункции

&НаКлиенте
Процедура ПолучитьВладельцаКартыЛукойл()
	
	ТекстОшибки = "";
	НаименованиеВладельца = "";
	
	СтруктураПараметровУчетнойЗаписи = уатЗагрузкаПЦ.ПолучитьСтруктуруПараметровДляРаботыСПЦ(УчетнаяЗаписьПЦ);
	ДетальнаяИнформацияПоДоговору = уатЗагрузкаПЦ.ЛИКАРД_ПолучитьИнформациюПоДоговору(СтруктураПараметровУчетнойЗаписи, ТекстОшибки);
	Если НЕ ЗначениеЗаполнено(ТекстОшибки) Тогда
		clientId = ДетальнаяИнформацияПоДоговору.clientId;
		СоответствиеВодителей = уатЗагрузкаПЦ.ЛИКАРД_ПолучитьСписокВодителей(СтруктураПараметровУчетнойЗаписи, clientId, ТекстОшибки);
		
		IDКонтракта     = СтрЗаменить(СтрЗаменить(Строка(Объект.Код), Символы.НПП, ""), " ", "");
	
		ДетальнаяИнформацияПоКарте = уатЗагрузкаПЦ.ЛИКАРД_ДетальнаяИнформацияПоКарте(СтруктураПараметровУчетнойЗаписи, Объект.IDкарты, ТекстОшибки);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Возврат;
		КонецЕсли;
		СтруктураВодителя = СоответствиеВодителей.Получить(ДетальнаяИнформацияПоКарте.Получить("driverId"));
		
		Если СтруктураВодителя <> Неопределено Тогда
			НаименованиеВладельца = ?(ЗначениеЗаполнено(СтруктураВодителя.НаименованиеВодителя),
				СтруктураВодителя.НаименованиеВодителя, СтруктураВодителя.НаименованиеТС);
			ВладелецКарты = уатЗагрузкаПЦ.ЛИКАРД_УстановитьВладельцаТопливнойКарты(НаименованиеВладельца);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВладелецКарты) Тогда
		Если ЗначениеЗаполнено(НаименованиеВладельца) Тогда
			ТекстНстр = СтрШаблон(Нстр("ru = 'Владелец карты не найден (%1).'; en = 'Card owner not found (%1).'"), НаименованиеВладельца);
		Иначе
			ТекстНстр = Нстр("ru = 'Владелец карты не найден.'; en = 'Card owner not found.'");
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНстр);
		Возврат
	Иначе
		Объект.КомуВыдана = ВладелецКарты;
		ЗаписатьИсториюИзмененияВладельцаКарты(Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЛимитыСервер()
	ТекстОшибки = "";  
	
	СтруктураПараметровУчетнойЗаписи = уатЗагрузкаПЦ.ПолучитьСтруктуруПараметровДляРаботыСПЦ(УчетнаяЗаписьПЦ);
	СтруктураПараметровУчетнойЗаписи.Вставить("АЗС", Объект.КемВыдана);
	
	Если ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.ЛукойлЛИКАРД") Тогда
		МассивЛимитов = уатЗагрузкаПЦ.ЛИКАРД_ПолучитьЛимитыКарт(СтруктураПараметровУчетнойЗаписи, Объект.IDкарты, ТекстОшибки); 
	ИначеЕсли ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Газпромнефть") Тогда
		МассивЛимитов = уатЗагрузкаПЦ.Газпромнефть_ПолучитьЛимитыКарт(СтруктураПараметровУчетнойЗаписи, Объект.IDкарты, ТекстОшибки);
	ИначеЕсли ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Роснефть") Тогда
		МассивЛимитов = уатЗагрузкаПЦ.Роснефть_ПолучитьЛимитыКарт(СтруктураПараметровУчетнойЗаписи, Объект.IDкарты, ТекстОшибки);
	КонецЕсли; 
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;  
	Если МассивЛимитов.Количество() = 0 Тогда
		ТекстНстр = Нстр("ru = 'Лимиты карты не найдены.'; en = 'Card limits not found.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНстр);
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.уатИсторияУстановкиЛимитовТопливныхКарт.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Карта.Установить(Объект.Ссылка); 
	НаборЗаписей.Прочитать();
	Для Каждого ТекЗапись Из НаборЗаписей Цикл
		ТекЗапись.Действует = Ложь;
	КонецЦикла;
	Попытка
		НаборЗаписей.Записать();
	Исключение
	КонецПопытки;
	
	Для Каждого ТекЛимит Из МассивЛимитов Цикл
		Если ТекЛимит.Лимит = 0 Тогда
			Продолжить;
		КонецЕсли;

		МенеджерЗаписи = РегистрыСведений.уатИсторияУстановкиЛимитовТопливныхКарт.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекЛимит);
		МенеджерЗаписи.Карта		 = Объект.Ссылка;
		МенеджерЗаписи.КомуВыдана	 = Объект.КомуВыдана;
		МенеджерЗаписи.Действует	 = Истина;
		Попытка
			МенеджерЗаписи.Записать(Истина);
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючЗаписиИсторияПеремещенияТопливныхКарт(Карта)
	
	ЗначениеКлюча = Новый Структура;
	ЗначениеКлюча.Вставить("Карта", Карта);
	ЗначениеКлюча.Вставить("Период", НачалоДня(ТекущаяДата()));
	Возврат РегистрыСведений.уатИсторияПеремещенияТопливныхКарт.СоздатьКлючЗаписи(ЗначениеКлюча);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
КонецФункции

&НаСервере
Процедура ПолучитьСтатусКарты(ИзменятьСтатус = Ложь)
	
	Элементы.ФормаЗаблокироватьРазблокировать.Заголовок = Нстр("ru = 'Заблокировать'; en = 'Block'");
	
	Если ТипЗнч(Объект.КемВыдана) <> Тип("СправочникСсылка.уатАЗС") 
		ИЛИ НЕ ЗначениеЗаполнено(Объект.IDкарты) Тогда
		Возврат;
	КонецЕсли;
	
	флБлокировки = Ложь;
	
	Если ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Газпромнефть") Тогда
		ПолучитьСтатусКартыГазпромнефть(ИзменятьСтатус);
	ИначеЕсли ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.ЛукойлЛИКАРД") Тогда
		ПолучитьСтатусКартыЛукойл(ИзменятьСтатус);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтатусКартыГазпромнефть(ИзменятьСтатус = Ложь)
	
	ТекстОшибки = "";
	
	СтруктураПараметровУчетнойЗаписи = уатЗагрузкаПЦ.ПолучитьСтруктуруПараметровДляРаботыСПЦ(УчетнаяЗаписьПЦ);
	ДетальнаяИнформацияПоКарте = уатЗагрузкаПЦ.Газпромнефть_ПолучитьИнформациюПоКарте(СтруктураПараметровУчетнойЗаписи, Объект.IDкарты, ТекстОшибки);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если ДетальнаяИнформацияПоКарте = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИзменятьСтатус Тогда
		Статус = ДетальнаяИнформацияПоКарте.СтатусСсылка;
		Если Статус <> Объект.Статус Тогда
			Объект.Статус		 = Статус;
			Модифицированность	 = Истина;
		Конецесли;
	КонецЕсли;
	
	ПолучитьЗаголовокБлокировки();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтатусКартыЛукойл(ИзменятьСтатус = Ложь)
	
	ТекстОшибки = "";
	
	IDкарты = СтрЗаменить(СтрЗаменить(Объект.IDкарты, Символы.НПП, ""), " ", "");
	СтруктураПараметровУчетнойЗаписи = уатЗагрузкаПЦ.ПолучитьСтруктуруПараметровДляРаботыСПЦ(УчетнаяЗаписьПЦ);

	ДетальнаяИнформацияПоКарте = уатЗагрузкаПЦ.ЛИКАРД_ДетальнаяИнформацияПоКарте(СтруктураПараметровУчетнойЗаписи, IDкарты, ТекстОшибки);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	result = ДетальнаяИнформацияПоКарте;
	status = result.Получить("trackingStatus");
	Если ТипЗнч(status) = Тип("Строка") Тогда
		Если ИзменятьСтатус Тогда
			Статус = уатЗагрузкаПЦ.ПолучитьСтатусКарты(status, СтруктураПараметровУчетнойЗаписи);
			Если Статус <> Объект.Статус Тогда
				Объект.Статус		 = Статус;
				Модифицированность	 = Истина;
			Конецесли;
		КонецЕсли;
	КонецЕсли;
	
	ПолучитьЗаголовокБлокировки();
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДругуюОсновнуюКарту(Ссылка, КомуВыдана)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	уатПластиковыеКарты.Основная,
	|	уатПластиковыеКарты.КомуВыдана,
	|	уатПластиковыеКарты.КемВыдана,
	|	уатПластиковыеКарты.Ссылка
	|ИЗ
	|	Справочник.уатПластиковыеКарты КАК уатПластиковыеКарты
	|ГДЕ
	|	уатПластиковыеКарты.КомуВыдана = &КомуВыдана
	|	И уатПластиковыеКарты.Основная
	|	И уатПластиковыеКарты.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("КомуВыдана", КомуВыдана);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("Ссылка, КемВыдана", Выборка.Ссылка, Выборка.КемВыдана);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЗаписатьИсториюИзмененияВладельцаКарты(Знач ТекущийОбъект)
	
	НаборЗаписей = РегистрыСведений.уатИсторияПеремещенияТопливныхКарт.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Карта.Установить(ТекущийОбъект.Ссылка); 
	НаборЗаписей.Прочитать();

	Запись = НаборЗаписей.Добавить();
	Запись.Период		 = ?(ЗначениеЗаполнено(ТекущийОбъект.ДатаВыдачи), ТекущийОбъект.ДатаВыдачи, ТекущаяДата());
	Запись.Карта		 = ТекущийОбъект.Ссылка;
	Запись.КомуВыдана	 = ТекущийОбъект.КомуВыдана;
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначенияЗаписиИстории(Ссылка)
	ТаблицаРегистра = РегистрыСведений.уатИсторияПеремещенияТопливныхКарт.СрезПоследних(, Новый Структура("Карта", Ссылка));
	
	СтруктураРеквизитов = Новый Структура;
	
	Если ТаблицаРегистра.Количество() > 0 Тогда
		СтруктураРеквизитов.Вставить("Период",        ТаблицаРегистра[0].Период);
		СтруктураРеквизитов.Вставить("Карта", ТаблицаРегистра[0].Карта);
		СтруктураРеквизитов.Вставить("КомуВыдана", ТаблицаРегистра[0].КомуВыдана);
	Иначе
		СтруктураРеквизитов.Вставить("Период", '00010101');
	КонецЕсли;
	
	Возврат СтруктураРеквизитов;
КонецФункции

&НаСервереБезКонтекста
Функция ОбновитьДанныеОВладельце(Ссылка)

	ИсторияПеремещенияТопливныхКартСрезПоследних = Новый Структура("ДатаВыдачи, КомуВыдана", Дата(1,1,1), Неопределено);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уатИсторияПеремещенияТопливныхКартСрезПоследних.Период,
	               |	уатИсторияПеремещенияТопливныхКартСрезПоследних.КомуВыдана
	               |ИЗ
	               |	РегистрСведений.уатИсторияПеремещенияТопливныхКарт.СрезПоследних(&Дата, Карта = &Карта) КАК уатИсторияПеремещенияТопливныхКартСрезПоследних";
	
	Запрос.УстановитьПараметр("Карта", Ссылка);
	Запрос.УстановитьПараметр("Дата",  ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ИсторияПеремещенияТопливныхКартСрезПоследних.ДатаВыдачи = Выборка.Период;
		ИсторияПеремещенияТопливныхКартСрезПоследних.КомуВыдана = Выборка.КомуВыдана;
	КонецЕсли;
	
	Возврат ИсторияПеремещенияТопливныхКартСрезПоследних;
	
КонецФункции

&НаКлиенте
Процедура ДекорацияДекорацияИзменитьВладельцаНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	СтруктураИстории	 = ОбновитьДанныеОВладельце(Объект.Ссылка);
	ЗаполнитьЗначенияСвойств(Объект, СтруктураИстории);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзменениеСтатусаБлокировкиТопливныхКарт(Карта, КомуВыдана, ДатаУстановки, Заблокирована)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Карта", Карта);
	Запрос.УстановитьПараметр("КомуВыдана", КомуВыдана);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	уатИсторияИзмененияСтатусаБлокировкиТопливныхКарт.Заблокирована КАК Заблокирована
	               |ИЗ
	               |	РегистрСведений.уатИсторияИзмененияСтатусаБлокировкиТопливныхКарт КАК уатИсторияИзмененияСтатусаБлокировкиТопливныхКарт
	               |ГДЕ
	               |	уатИсторияИзмененияСтатусаБлокировкиТопливныхКарт.Карта = &Карта
	               |	И уатИсторияИзмененияСтатусаБлокировкиТопливныхКарт.КомуВыдана = &КомуВыдана
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	уатИсторияИзмененияСтатусаБлокировкиТопливныхКарт.ДатаУстановки УБЫВ";
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Заблокирована = Выборка.Заблокирована Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ИсторияИзмененийСтатусаБлокировкиТопливныхКарт = РегистрыСведений.уатИсторияИзмененияСтатусаБлокировкиТопливныхКарт.СоздатьНаборЗаписей();
	ИсторияИзмененийСтатусаБлокировкиТопливныхКарт.Отбор.Карта.Установить(Карта);
	ИсторияИзмененийСтатусаБлокировкиТопливныхКарт.Отбор.КомуВыдана.Установить(КомуВыдана);
	ИсторияИзмененийСтатусаБлокировкиТопливныхКарт.Отбор.ДатаУстановки.Установить(ДатаУстановки);
	ИсторияИзмененийСтатусаБлокировкиТопливныхКарт.Прочитать();

	Если ИсторияИзмененийСтатусаБлокировкиТопливныхКарт.Количество() <> 0 Тогда
		ИсторияИзмененийСтатусаБлокировкиТопливныхКарт.Очистить();
	КонецЕсли;

	НоваяЗапись = ИсторияИзмененийСтатусаБлокировкиТопливныхКарт.Добавить();
	НоваяЗапись.Карта			 = Карта;
	НоваяЗапись.КомуВыдана		 = КомуВыдана;
	НоваяЗапись.ДатаУстановки	 = ДатаУстановки;
	
	НоваяЗапись.Заблокирована	 = Заблокирована;
	
	Попытка
		ИсторияИзмененийСтатусаБлокировкиТопливныхКарт.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ДатаВыдачиПриИзмененииСервер()
	Попытка
	СрезПоследних = РегистрыСведений.уатИсторияПеремещенияТопливныхКарт.СрезПоследних(, Новый Структура("Карта", Объект.Ссылка));
	Если СрезПоследних.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей  = РегистрыСведений.уатИсторияПеремещенияТопливныхКарт.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Карта.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	Для Каждого ТекЗапись Из  НаборЗаписей Цикл
		Если ТекЗапись.Период = СрезПоследних[0].Период Тогда
			ТекЗапись.Период = Объект.ДатаВыдачи;
			НаборЗаписей.Записать();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьУчетныеДанныеЛукойл(Номер)
	
	УчетнаяЗаписьПЦ = Новый Структура("АдресСервиса, Пароль, IDКонтракта, SSLСертификат");
	ЗаполнитьЗначенияСвойств(УчетнаяЗаписьПЦ, Объект.КемВыдана.УчетнаяЗаписьПЦ);
	УчетнаяЗаписьПЦ.IDКонтракта   = Номер;
	
	Возврат УчетнаяЗаписьПЦ;
	
КонецФункции

&НаКлиенте
Процедура ЗаблокироватьРазблокироватьГазпромнефть()
	
	Если ТипЗнч(Объект.КемВыдана) <> Тип("СправочникСсылка.уатАЗС") 
		И ЗначениеЗаполнено(Объект.IDкарты) Тогда
		Возврат;
	КонецЕсли;
	
	флБлокировки    = ?(Элементы.ФормаЗаблокироватьРазблокировать.Заголовок = Нстр("ru = 'Разблокировать'; en = 'Unblock'"), Ложь, Истина);
	текФлБлокировки = флБлокировки;
	
	ТекстОшибки = "";
	СтруктураПараметровУчетнойЗаписи = уатЗагрузкаПЦ.ПолучитьСтруктуруПараметровДляРаботыСПЦ(УчетнаяЗаписьПЦ);
	Выполнено   = уатЗагрузкаПЦ.Газпромнефть_БлокироватьРазблокироватьКарту(СтруктураПараметровУчетнойЗаписи, Объект.IDкарты, текФлБлокировки, ТекстОшибки);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ПолучитьСтатусКарты(Истина);
	
	Если флБлокировки = текФлБлокировки Тогда
		ЗаписатьИзменениеСтатусаБлокировкиТопливныхКарт(Объект.Ссылка, Объект.КомуВыдана, ТекущаяДата(), текФлБлокировки);
		
		ТекстНстр = ?(текФлБлокировки, Нстр("ru = 'Карта заблокирована'; en = 'The card is blocked'"), Нстр("ru = 'Карта разблокирована'; en = 'The card is unblocked'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНстр);
	Иначе
		ТекстНстр = Нстр("ru = 'Статус карты не изменился'; en = 'The card status has not changed.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНстр);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаблокироватьРазблокироватьЛукойл()
	
	Если ТипЗнч(Объект.КемВыдана) <> Тип("СправочникСсылка.уатАЗС") 
		ИЛИ НЕ ЗначениеЗаполнено(Объект.IDкарты) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки			 = "";
	
	текФлБлокировки = ?(Элементы.ФормаЗаблокироватьРазблокировать.Заголовок = Нстр("ru = 'Разблокировать'; en = 'Unblock'"), Ложь, Истина);
	
	УчетнаяЗаписьПЦ = ЗаполнитьУчетныеДанныеЛукойл("");

	СтруктураПараметровУчетнойЗаписи = уатЗагрузкаПЦ.ПолучитьСтруктуруПараметровДляРаботыСПЦ(УчетнаяЗаписьПЦ);
	уатЗагрузкаПЦ.ЛИКАРД_БлокироватьРазблокироватьКарту(СтруктураПараметровУчетнойЗаписи, Объект.IDкарты, текФлБлокировки, ТекстОшибки);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ПолучитьСтатусКарты(Истина);
	
	Если флБлокировки = текФлБлокировки Тогда
		ЗаписатьИзменениеСтатусаБлокировкиТопливныхКарт(Объект.Ссылка, Объект.КомуВыдана, ТекущаяДата(), текФлБлокировки);
		
		ТекстНстр = ?(текФлБлокировки, Нстр("ru = 'Карта заблокирована'; en = 'The card is blocked'"), Нстр("ru = 'Карта разблокирована'; en = 'The card is unblocked'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНстр);
	Иначе
		ТекстНстр = Нстр("ru = 'Статус карты не изменился'; en = 'The card status has not changed.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНстр);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьНезначащиеСимволы(ЗначениеНастройки)
	
	ЗначениеНастройки = СокрЛП(ЗначениеНастройки);

КонецПроцедуры

&НаСервере
Процедура ПолучитьЗаголовокБлокировки()
	
	Если ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Газпромнефть") Тогда
		Статус = Объект.Статус;
		Если СтрНайти(Статус.НаименованиеВСистемеПоставщика, "Locked") <> 0 Тогда
			Элементы.ФормаЗаблокироватьРазблокировать.Заголовок = Нстр("ru = 'Разблокировать'; en = 'Unblock'");
			флБлокировки = Истина;
		Иначе
			Элементы.ФормаЗаблокироватьРазблокировать.Заголовок = Нстр("ru = 'Заблокировать'; en = 'Block'");
			флБлокировки = Ложь;
		КонецЕсли;

	ИначеЕсли ВнешняяСистема = ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.ЛукойлЛИКАРД") Тогда
		Статус = Объект.Статус;
		Если Статус.НаименованиеВСистемеПоставщика = "CC051" 
			ИЛИ Статус.НаименованиеВСистемеПоставщика = "CC052" Тогда
			Элементы.ФормаЗаблокироватьРазблокировать.Заголовок = Нстр("ru = 'Разблокировать'; en = 'Unblock'");
			флБлокировки = Истина;
		Иначе
			Элементы.ФормаЗаблокироватьРазблокировать.Заголовок = Нстр("ru = 'Заблокировать'; en = 'Block'");
			флБлокировки = Ложь;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПолей()
	
	ЗаблокированныеРеквизиты = ЗапретРедактированияРеквизитовОбъектовКлиент.Реквизиты(ЭтотОбъект);
	
	Если ЗаблокированныеРеквизиты.Количество() > 0 Тогда
		РазблокируемыеРеквизиты = Новый Массив();
		Если Не ЗначениеЗаполнено(Объект.КомуВыдана) Тогда
			РазблокируемыеРеквизиты.Добавить("КомуВыдана");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ДатаВыдачи) Тогда
			РазблокируемыеРеквизиты.Добавить("ДатаВыдачи");
		КонецЕсли;
		Если РазблокируемыеРеквизиты.Количество() <> 0 Тогда
			ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(ЭтотОбъект, РазблокируемыеРеквизиты);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтборы()
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Лимиты, "Карта", Объект.Ссылка, Истина);
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ИсторияПеремещения, "Карта", Объект.Ссылка, Истина); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Лимиты.Отбор, "Действует",
			Истина, ВидСравненияКомпоновкиДанных.Равно,, Истина);
КонецПроцедуры


#КонецОбласти
